function initCLI(program) {
    program
        .name('ignis')
        .action(() => {
            const asciiArt = `
 ██╗ ██████╗ ███╗   ██╗██╗███████╗     ██████╗██╗     ██╗
███║██╔════╝ ████╗  ██║██║██╔════╝    ██╔════╝██║     ██║
╚██║██║  ███╗██╔██╗ ██║██║███████╗    ██║     ██║     ██║
 ██║██║   ██║██║╚██╗██║██║╚════██║    ██║     ██║     ██║
 ██║╚██████╔╝██║ ╚████║██║███████║    ╚██████╗███████╗██║
 ╚═╝ ╚═════╝ ╚═╝  ╚═══╝╚═╝╚══════╝     ╚═════╝╚══════╝╚═╝

Bienvenido a Ignis-CLI 🐉
Versión: ${process.env.npm_package_version || '1.0.0'}
`;

            console.log(asciiArt);
        })
}

module.exports = initCLI
